In [1]:
import pandas as pd

# creating a data frame using list

In [2]:
name=['madhu','kaushik','rajesh']
age=[21,22,22]
name,age

(['madhu', 'kaushik', 'rajesh'], [21, 22, 22])

# data frame creation

In [3]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

# providing information

In [4]:
pd.DataFrame(zip(name,age))

         0   1
0    madhu  21
1  kaushik  22
2   rajesh  22

# providing columns

In [6]:
name=['madhu','kaushik','rajesh']
age=[21,22,22]
pd.DataFrame(zip(name,age),columns=['NAME','AGE'])

      NAME  AGE
0    madhu   21
1  kaushik   22
2   rajesh   22

In [9]:
names=zip(name,age)
cols=['NAME','AGE']
pd.DataFrame(names,columns=cols)

      NAME  AGE
0    madhu   21
1  kaushik   22
2   rajesh   22

# providing index

In [12]:
names=zip(name,age)
cols=['NAME','AGE']
ind=['A','B','C']
pd.DataFrame(names,columns=cols,index=ind)

      NAME  AGE
A    madhu   21
B  kaushik   22
C   rajesh   22

# adding columns

In [14]:
names=zip(name,age)
cols=['NAME','AGE']
ind=['A','B','C']
df=pd.DataFrame(names,columns=cols,index=ind)
df

      NAME  AGE
A    madhu   21
B  kaushik   22
C   rajesh   22

In [15]:
bday=['22 august 2002','26 january 2002','10 december 2001']
df["BIRTHDAY"]=bday
df

      NAME  AGE          BIRTHDAY
A    madhu   21    22 august 2002
B  kaushik   22   26 january 2002
C   rajesh   22  10 december 2001

# updating a column

In [27]:
df["AGE"]=[22,22,22]
df
df["NAME"]=['MADHU GEETHANJALI','KAUSHIK','RAJESH']
df

                NAME  AGE
A  MADHU GEETHANJALI   22
B            KAUSHIK   22
C             RAJESH   22

# drop the column

In [30]:
df.drop('AGE',axis=1,inplace=True)
df

                NAME
A  MADHU GEETHANJALI
B            KAUSHIK
C             RAJESH

# drop the row

In [37]:
df.drop('B',axis=0,inplace=True)
df

                NAME
A  MADHU GEETHANJALI

# save the data

In [39]:
df.to_csv("friends.csv",index=False)
df

                NAME
A  MADHU GEETHANJALI

In [43]:
d1={"name":['madhu','kaushik','rajesh'],
"age":[21,22,22]}
pd.DataFrame(d1)

      name  age
0    madhu   21
1  kaushik   22
2   rajesh   22